Revit 2024 API
BuiltInFailures.FamilyFailures.FamilyDoesntMatchSystemPropertiesDisconnected Property
 The family no longer matches the properties for the System. Disconnect the family from the System?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FamilyDoesntMatchSystemPropertiesDisconnected { get; }
Visual Basic
Public Shared ReadOnly Property FamilyDoesntMatchSystemPropertiesDisconnected As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FamilyDoesntMatchSystemPropertiesDisconnected {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace